geo-finder-backend/app/controllers/summaries_controller.rb

    def index
        summaries = Summary.all
---
SELECT "summaries".* FROM "summaries"

    def show
        summary = Summary.find(params[:id])
---
SELECT "summaries".* FROM "summaries" WHERE "summaries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def getSummaryOfUser
        summaries = Summary.where(user_id: params[:userId])
---
SELECT "summaries".* FROM "summaries" WHERE "summaries"."user_id" = $1  [["user_id", 1]]

    def create
        user = User.find(params[:user_id])
        summary = Summary.create(set_param)
        user.points = user.points + summary.points
        user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
INSERT INTO "summaries" ("points", "input_lat", "input_lng", "actual_lat", "actual_lng", "guessed_address", "actual_address", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
UPDATE "users" SET "points" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["points", 94], ["updated_at", "2019-11-16 16:35:01.429376"], ["id", 2]]

    def destroy
        summary = Summary.find(params[:id])
        summary.destroy
---
SELECT "summaries".* FROM "summaries" WHERE "summaries"."id" = $1 LIMIT $2  [["id", 58], ["LIMIT", 1]]
DELETE FROM "summaries" WHERE "summaries"."id" = $1  [["id", 1]]